"1 82 1 4206624770 ,"
"input 1 1 128 128 ,"
" 260 261 275 276 290 304 305 319 320 334 348 349 363 364 378 379 393 394 408 409 423 437 438 452 453 467 468 482 483 497 498 512 513 527 528 542 543 557 558 572 573 587 588 602 603 617 618 632 633 647 648 662 663 677 678 692 693 707 708 722 723 737 738 752 753 767 768 782 796 797 811 812 826 827 841 842 843 851 852 853 854 input ,"
"852 855 ,"
" 81 ,"
"Convolution 260 1 1 input 260 1 1 16 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 261 1 1 260 261 ,"
"Convolution 275 1 1 261 275 16 1 16 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 276 1 1 275 276 ,"
"Convolution 290 1 1 276 290 1 16 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 304 1 1 290 304 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 305 1 1 304 305 ,"
"Convolution 319 1 1 305 319 192 1 192 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 320 1 1 319 320 ,"
"Convolution 334 1 1 320 334 1 192 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 348 1 1 334 348 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 349 1 1 348 349 ,"
"Convolution 363 1 1 349 363 288 1 288 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 364 1 1 363 364 ,"
"Convolution 378 1 1 364 378 1 288 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 379 2 1 334 378 379 ,"
"Convolution 393 1 1 379 393 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 394 1 1 393 394 ,"
"Convolution 408 1 1 394 408 288 1 288 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 409 1 1 408 409 ,"
"Convolution 423 1 1 409 423 1 288 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 437 1 1 423 437 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 438 1 1 437 438 ,"
"Convolution 452 1 1 438 452 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 453 1 1 452 453 ,"
"Convolution 467 1 1 453 467 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 468 2 1 423 467 468 ,"
"Convolution 482 1 1 468 482 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 483 1 1 482 483 ,"
"Convolution 497 1 1 483 497 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 498 1 1 497 498 ,"
"Convolution 512 1 1 498 512 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 513 2 1 468 512 513 ,"
"Convolution 527 1 1 513 527 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 528 1 1 527 528 ,"
"Convolution 542 1 1 528 542 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 543 1 1 542 543 ,"
"Convolution 557 1 1 543 557 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 558 2 1 513 557 558 ,"
"Convolution 572 1 1 558 572 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 573 1 1 572 573 ,"
"Convolution 587 1 1 573 587 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 588 1 1 587 588 ,"
"Convolution 602 1 1 588 602 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 603 2 1 558 602 603 ,"
"Convolution 617 1 1 603 617 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 618 1 1 617 618 ,"
"Convolution 632 1 1 618 632 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 633 1 1 632 633 ,"
"Convolution 647 1 1 633 647 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 648 2 1 603 647 648 ,"
"Convolution 662 1 1 648 662 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 663 1 1 662 663 ,"
"Convolution 677 1 1 663 677 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 678 1 1 677 678 ,"
"Convolution 692 1 1 678 692 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 693 2 1 648 692 693 ,"
"Convolution 707 1 1 693 707 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 708 1 1 707 708 ,"
"Convolution 722 1 1 708 722 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 723 1 1 722 723 ,"
"Convolution 737 1 1 723 737 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 738 2 1 693 737 738 ,"
"Convolution 752 1 1 738 752 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 753 1 1 752 753 ,"
"Convolution 767 1 1 753 767 384 1 384 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 768 1 1 767 768 ,"
"Convolution 782 1 1 768 782 1 384 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 796 1 1 782 796 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 797 1 1 796 797 ,"
"Convolution 811 1 1 797 811 576 1 576 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 812 1 1 811 812 ,"
"Convolution 826 1 1 812 826 1 576 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 827 2 1 782 826 827 ,"
"Convolution 841 1 1 827 841 1 96 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 842 1 1 841 842 ,"
"Pooling 843 1 1 842 843 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape 851 1 1 843 851 0 4 4 0 -1 1 1 ,"
"InnerProduct 852 1 1 851 852 234 1 0 1 ,"
"InnerProduct 854 1 1 851 854 1 1 0 1 ,"
"Sigmoid label_sigmoid 1 1 854 855 ,"