"1 81 1 4206624770 ,"
"input 1 1 128 128 ,"
" 258 259 273 274 288 302 303 317 318 332 346 347 361 362 376 377 391 392 406 407 421 422 436 437 451 452 466 480 481 495 496 510 511 525 526 540 541 555 556 570 571 585 586 600 601 615 616 630 631 645 646 660 661 675 676 690 691 705 706 720 721 735 736 750 751 765 766 780 794 795 809 810 824 825 839 840 841 849 850 851 input ,"
"850 ,"
" 79 ,"
"Convolution 258 1 1 input 258 1 1 24 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 259 1 1 258 259 ,"
"Convolution 273 1 1 259 273 24 1 24 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 274 1 1 273 274 ,"
"Convolution 288 1 1 274 288 1 24 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 302 1 1 288 302 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 303 1 1 302 303 ,"
"Convolution 317 1 1 303 317 192 1 192 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 318 1 1 317 318 ,"
"Convolution 332 1 1 318 332 1 192 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 346 1 1 332 346 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 347 1 1 346 347 ,"
"Convolution 361 1 1 347 361 288 1 288 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 362 1 1 361 362 ,"
"Convolution 376 1 1 362 376 1 288 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 377 2 1 332 376 377 ,"
"Convolution 391 1 1 377 391 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 392 1 1 391 392 ,"
"Convolution 406 1 1 392 406 288 1 288 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 407 1 1 406 407 ,"
"Convolution 421 1 1 407 421 1 288 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 422 2 1 377 421 422 ,"
"Convolution 436 1 1 422 436 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 437 1 1 436 437 ,"
"Convolution 451 1 1 437 451 288 1 288 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 452 1 1 451 452 ,"
"Convolution 466 1 1 452 466 1 288 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 480 1 1 466 480 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 481 1 1 480 481 ,"
"Convolution 495 1 1 481 495 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 496 1 1 495 496 ,"
"Convolution 510 1 1 496 510 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 511 2 1 466 510 511 ,"
"Convolution 525 1 1 511 525 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 526 1 1 525 526 ,"
"Convolution 540 1 1 526 540 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 541 1 1 540 541 ,"
"Convolution 555 1 1 541 555 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 556 2 1 511 555 556 ,"
"Convolution 570 1 1 556 570 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 571 1 1 570 571 ,"
"Convolution 585 1 1 571 585 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 586 1 1 585 586 ,"
"Convolution 600 1 1 586 600 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 601 2 1 556 600 601 ,"
"Convolution 615 1 1 601 615 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 616 1 1 615 616 ,"
"Convolution 630 1 1 616 630 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 631 1 1 630 631 ,"
"Convolution 645 1 1 631 645 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 646 2 1 601 645 646 ,"
"Convolution 660 1 1 646 660 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 661 1 1 660 661 ,"
"Convolution 675 1 1 661 675 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 676 1 1 675 676 ,"
"Convolution 690 1 1 676 690 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 691 2 1 646 690 691 ,"
"Convolution 705 1 1 691 705 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 706 1 1 705 706 ,"
"Convolution 720 1 1 706 720 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 721 1 1 720 721 ,"
"Convolution 735 1 1 721 735 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 736 2 1 691 735 736 ,"
"Convolution 750 1 1 736 750 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 751 1 1 750 751 ,"
"Convolution 765 1 1 751 765 384 1 384 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 766 1 1 765 766 ,"
"Convolution 780 1 1 766 780 1 384 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 794 1 1 780 794 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 795 1 1 794 795 ,"
"Convolution 809 1 1 795 809 576 1 576 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 810 1 1 809 810 ,"
"Convolution 824 1 1 810 824 1 576 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 825 2 1 780 824 825 ,"
"Convolution 839 1 1 825 839 1 96 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 840 1 1 839 840 ,"
"Pooling 841 1 1 840 841 1 0 0 1 1 0 0 -1 -1 -1 0 ,"
"Reshape 849 1 1 841 849 0 4 4 0 -1 1 1 ,"
"InnerProduct 850 1 1 849 850 316 1 0 1 ,"