"1 155 1 4206624770 ,"
"input_array 1 3 256 256 ,"
" 541 542 544 545 547 548 550 551 553 555 556 558 559 561 562 564 565 567 568 570 572 573 575 576 578 579 581 582 584 585 587 588 590 591 593 594 596 597 599 600 602 603 605 607 608 610 611 613 614 616 617 619 620 622 623 625 626 628 629 631 633 634 636 637 639 640 642 643 645 646 648 650 651 653 654 656 657 659 660 662 663 665 666 668 669 671 672 674 675 677 678 680 681 683 684 686 687 689 690 692 693 695 696 698 699 701 702 704 705 707 708 710 711 713 714 716 717 719 721 722 724 725 727 729 730 731 733 734 736 737 738 740 741 742 744 745 746 747 749 750 751 753 754 755 756 758 759 760 762 763 765 766 767 input_array output_array background foreground ,"
"background foreground ,"
" 156 ,"
"Convolution 541 1 1 input_array 541 1 3 8 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 542 1 1 541 542 ,"
"Convolution 544 1 1 542 544 1 8 4 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 545 1 1 544 545 ,"
"Convolution 547 1 1 545 547 1 4 12 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 548 1 1 547 548 ,"
"Convolution 550 1 1 548 550 12 1 12 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 551 1 1 550 551 ,"
"Convolution 553 1 1 551 553 1 12 6 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 555 1 1 553 555 1 6 18 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 556 1 1 555 556 ,"
"Convolution 558 1 1 556 558 18 1 18 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 559 1 1 558 559 ,"
"Convolution 561 1 1 559 561 1 18 6 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 562 2 1 561 553 562 ,"
"Convolution 564 1 1 562 564 1 6 18 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 565 1 1 564 565 ,"
"Convolution 567 1 1 565 567 18 1 18 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 568 1 1 567 568 ,"
"Convolution 570 1 1 568 570 1 18 10 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 572 1 1 570 572 1 10 30 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 573 1 1 572 573 ,"
"Convolution 575 1 1 573 575 30 1 30 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 576 1 1 575 576 ,"
"Convolution 578 1 1 576 578 1 30 10 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 579 2 1 578 570 579 ,"
"Convolution 581 1 1 579 581 1 10 30 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 582 1 1 581 582 ,"
"Convolution 584 1 1 582 584 30 1 30 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 585 1 1 584 585 ,"
"Convolution 587 1 1 585 587 1 30 10 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 588 2 1 587 579 588 ,"
"Convolution 590 1 1 588 590 1 10 30 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 591 1 1 590 591 ,"
"Convolution 593 1 1 591 593 30 1 30 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 594 1 1 593 594 ,"
"Convolution 596 1 1 594 596 1 30 10 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 597 2 1 596 588 597 ,"
"Convolution 599 1 1 597 599 1 10 60 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 600 1 1 599 600 ,"
"Convolution 602 1 1 600 602 60 1 60 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 603 1 1 602 603 ,"
"Convolution 605 1 1 603 605 1 60 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 607 1 1 605 607 1 20 120 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 608 1 1 607 608 ,"
"Convolution 610 1 1 608 610 120 1 120 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 611 1 1 610 611 ,"
"Convolution 613 1 1 611 613 1 120 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 614 2 1 613 605 614 ,"
"Convolution 616 1 1 614 616 1 20 120 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 617 1 1 616 617 ,"
"Convolution 619 1 1 617 619 120 1 120 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 620 1 1 619 620 ,"
"Convolution 622 1 1 620 622 1 120 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 623 2 1 622 614 623 ,"
"Convolution 625 1 1 623 625 1 20 120 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 626 1 1 625 626 ,"
"Convolution 628 1 1 626 628 120 1 120 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 629 1 1 628 629 ,"
"Convolution 631 1 1 629 631 1 120 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 633 1 1 631 633 1 24 144 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 634 1 1 633 634 ,"
"Convolution 636 1 1 634 636 144 1 144 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 637 1 1 636 637 ,"
"Convolution 639 1 1 637 639 1 144 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 640 2 1 639 631 640 ,"
"Convolution 642 1 1 640 642 1 24 144 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 643 1 1 642 643 ,"
"Convolution 645 1 1 643 645 144 1 144 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU 646 1 1 645 646 ,"
"Convolution 648 1 1 646 648 1 144 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 650 1 1 648 650 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 651 1 1 650 651 ,"
"Convolution 653 1 1 651 653 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 654 1 1 653 654 ,"
"Convolution 656 1 1 654 656 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 657 2 1 656 648 657 ,"
"Convolution 659 1 1 657 659 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 660 1 1 659 660 ,"
"Convolution 662 1 1 660 662 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 663 1 1 662 663 ,"
"Convolution 665 1 1 663 665 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 666 2 1 665 657 666 ,"
"Convolution 668 1 1 666 668 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 669 1 1 668 669 ,"
"Convolution 671 1 1 669 671 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 672 1 1 671 672 ,"
"Convolution 674 1 1 672 674 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 675 2 1 674 666 675 ,"
"Convolution 677 1 1 675 677 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 678 1 1 677 678 ,"
"Convolution 680 1 1 678 680 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 681 1 1 680 681 ,"
"Convolution 683 1 1 681 683 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 684 2 1 683 675 684 ,"
"Convolution 686 1 1 684 686 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 687 1 1 686 687 ,"
"Convolution 689 1 1 687 689 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 690 1 1 689 690 ,"
"Convolution 692 1 1 690 692 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 693 2 1 692 684 693 ,"
"Convolution 695 1 1 693 695 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 696 1 1 695 696 ,"
"Convolution 698 1 1 696 698 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 699 1 1 698 699 ,"
"Convolution 701 1 1 699 701 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 702 2 1 701 693 702 ,"
"Convolution 704 1 1 702 704 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 705 1 1 704 705 ,"
"Convolution 707 1 1 705 707 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 708 1 1 707 708 ,"
"Convolution 710 1 1 708 710 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add 711 2 1 710 702 711 ,"
"Convolution 713 1 1 711 713 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 714 1 1 713 714 ,"
"Convolution 716 1 1 714 716 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 717 1 1 716 717 ,"
"Convolution 719 1 1 717 719 1 192 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 721 1 1 719 721 1 48 288 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 722 1 1 721 722 ,"
"Convolution 724 1 1 722 724 288 1 288 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 725 1 1 724 725 ,"
"Convolution 727 1 1 725 727 1 288 80 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 729 1 1 727 729 1 80 48 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 730 1 1 729 730 ,"
"Add 731 2 1 719 730 731 ,"
"Convolution 733 1 1 731 733 1 48 48 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 734 1 1 733 734 ,"
"Convolution 736 1 1 734 736 1 48 20 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 737 1 1 736 737 ,"
"Convolution 738 1 1 623 738 1 20 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Deconvolution 740 1 1 737 740 20 1 20 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU 741 1 1 740 741 ,"
"Add 742 2 1 738 741 742 ,"
"Convolution 744 1 1 742 744 1 20 20 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 745 1 1 744 745 ,"
"Convolution 746 1 1 745 746 1 20 10 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 747 1 1 588 747 1 10 10 1 1 1 1 0 0 1 -1 1 1 ,"
"Deconvolution 749 1 1 746 749 10 1 10 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU 750 1 1 749 750 ,"
"Add 751 2 1 747 750 751 ,"
"Convolution 753 1 1 751 753 1 10 10 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 754 1 1 753 754 ,"
"Convolution 755 1 1 754 755 1 10 6 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution 756 1 1 562 756 1 6 6 1 1 1 1 0 0 1 -1 1 1 ,"
"Deconvolution 758 1 1 755 758 6 1 6 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU 759 1 1 758 759 ,"
"Add 760 2 1 756 759 760 ,"
"Convolution 762 1 1 760 762 1 6 6 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU 763 1 1 762 763 ,"
"Deconvolution 765 1 1 763 765 6 1 6 4 4 2 2 1 1 1 -1 1 1 ,"
"ReLU 766 1 1 765 766 ,"
"Convolution 767 1 1 766 767 1 6 4 3 3 1 1 1 1 1 -1 1 1 ,"
"Deconvolution output_array 1 1 767 output_array 2 2 2 4 4 2 2 1 1 1 -1 1 1 ,"
"Softmax softmax 1 1 output_array softmax_output ,"
"SplitV splitv 1 2 softmax_output background foreground 1 ,"
