"1 99 1 4206624770 ,"
"x.1 1 3 128 128 ,"
" 102 103 104 105 106 107 131 132 133 134 135 159 160 184 185 186 187 188 212 213 214 215 216 240 241 242 243 244 268 269 293 294 295 296 297 321 322 323 324 325 349 350 351 352 353 377 378 379 380 381 405 406 407 408 409 433 434 435 436 437 461 462 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503 504 505 506 507 508 515 516 517 524 525 526 527 534 535 536 543 544 545 546 98 x.1 ,"
"544 546 ,"
" 100 ,"
"Pad Pad_23 1 1 x.1 98 0 0 1 2 1 2 0 0 0 0 ,"
"Convolution Conv_27 1 1 98 102 1 3 24 5 5 2 2 0 0 1 -1 1 1 ,"
"ReLU Relu_28 1 1 102 103 ,"
"Convolution Conv_29 1 1 103 104 24 1 24 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_30 1 1 104 105 1 24 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_31 2 1 105 103 106 ,"
"ReLU Relu_32 1 1 106 107 ,"
"Pad Pad_56 1 1 107 131 0 0 0 0 0 0 0 4 0 0 ,"
"Convolution Conv_57 1 1 107 132 24 1 24 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_58 1 1 132 133 1 24 28 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_59 2 1 133 131 134 ,"
"ReLU Relu_60 1 1 134 135 ,"
"Pad Pad_84 1 1 135 159 0 0 0 2 0 2 0 0 0 0 ,"
"Pooling MaxPool_85 1 1 135 160 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Pad Pad_109 1 1 160 184 0 0 0 0 0 0 0 4 0 0 ,"
"Convolution Conv_110 1 1 159 185 28 1 28 3 3 2 2 0 0 1 -1 1 1 ,"
"Convolution Conv_111 1 1 185 186 1 28 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_112 2 1 186 184 187 ,"
"ReLU Relu_113 1 1 187 188 ,"
"Pad Pad_137 1 1 188 212 0 0 0 0 0 0 0 4 0 0 ,"
"Convolution Conv_138 1 1 188 213 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_139 1 1 213 214 1 32 36 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_140 2 1 214 212 215 ,"
"ReLU Relu_141 1 1 215 216 ,"
"Pad Pad_165 1 1 216 240 0 0 0 0 0 0 0 6 0 0 ,"
"Convolution Conv_166 1 1 216 241 36 1 36 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_167 1 1 241 242 1 36 42 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_168 2 1 242 240 243 ,"
"ReLU Relu_169 1 1 243 244 ,"
"Pad Pad_193 1 1 244 268 0 0 0 2 0 2 0 0 0 0 ,"
"Pooling MaxPool_194 1 1 244 269 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Pad Pad_218 1 1 269 293 0 0 0 0 0 0 0 6 0 0 ,"
"Convolution Conv_219 1 1 268 294 42 1 42 3 3 2 2 0 0 1 -1 1 1 ,"
"Convolution Conv_220 1 1 294 295 1 42 48 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_221 2 1 295 293 296 ,"
"ReLU Relu_222 1 1 296 297 ,"
"Pad Pad_246 1 1 297 321 0 0 0 0 0 0 0 8 0 0 ,"
"Convolution Conv_247 1 1 297 322 48 1 48 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_248 1 1 322 323 1 48 56 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_249 2 1 323 321 324 ,"
"ReLU Relu_250 1 1 324 325 ,"
"Pad Pad_274 1 1 325 349 0 0 0 0 0 0 0 8 0 0 ,"
"Convolution Conv_275 1 1 325 350 56 1 56 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_276 1 1 350 351 1 56 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_277 2 1 351 349 352 ,"
"ReLU Relu_278 1 1 352 353 ,"
"Pad Pad_302 1 1 353 377 0 0 0 0 0 0 0 8 0 0 ,"
"Convolution Conv_303 1 1 353 378 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_304 1 1 378 379 1 64 72 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_305 2 1 379 377 380 ,"
"ReLU Relu_306 1 1 380 381 ,"
"Pad Pad_330 1 1 381 405 0 0 0 0 0 0 0 8 0 0 ,"
"Convolution Conv_331 1 1 381 406 72 1 72 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_332 1 1 406 407 1 72 80 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_333 2 1 407 405 408 ,"
"ReLU Relu_334 1 1 408 409 ,"
"Pad Pad_358 1 1 409 433 0 0 0 0 0 0 0 8 0 0 ,"
"Convolution Conv_359 1 1 409 434 80 1 80 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_360 1 1 434 435 1 80 88 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_361 2 1 435 433 436 ,"
"ReLU Relu_362 1 1 436 437 ,"
"Pad Pad_386 1 1 437 461 0 0 0 2 0 2 0 0 0 0 ,"
"Pooling MaxPool_387 1 1 437 462 0 2 2 2 2 0 0 -1 -1 -1 0 ,"
"Pad Pad_411 1 1 462 486 0 0 0 0 0 0 0 8 0 0 ,"
"Convolution Conv_412 1 1 461 487 88 1 88 3 3 2 2 0 0 1 -1 1 1 ,"
"Convolution Conv_413 1 1 487 488 1 88 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_414 2 1 488 486 489 ,"
"ReLU Relu_415 1 1 489 490 ,"
"Convolution Conv_416 1 1 490 491 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_417 1 1 491 492 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_418 2 1 492 490 493 ,"
"ReLU Relu_419 1 1 493 494 ,"
"Convolution Conv_420 1 1 494 495 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_421 1 1 495 496 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_422 2 1 496 494 497 ,"
"ReLU Relu_423 1 1 497 498 ,"
"Convolution Conv_424 1 1 498 499 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_425 1 1 499 500 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_426 2 1 500 498 501 ,"
"ReLU Relu_427 1 1 501 502 ,"
"Convolution Conv_428 1 1 502 503 96 1 96 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution Conv_429 1 1 503 504 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_430 2 1 504 502 505 ,"
"ReLU Relu_431 1 1 505 506 ,"
"Convolution Conv_432 1 1 437 507 1 88 2 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_433 1 1 507 508 4 0 2 3 1 ,"
"Reshape Reshape_440 1 1 508 515 0 4 4 0 -1 1 1 ,"
"Convolution Conv_441 1 1 506 516 1 96 6 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_442 1 1 516 517 4 0 2 3 1 ,"
"Reshape Reshape_449 1 1 517 524 0 4 4 0 -1 1 1 ,"
"Concat Concat_450 2 1 515 524 525 1 ,"
"Clip Clip_Score 1 1 525 545 -100.0 100.0 ,"
"Sigmoid Sigmoid_Score 1 1 545 546 ,"
"Convolution Conv_451 1 1 437 526 1 88 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_452 1 1 526 527 4 0 2 3 1 ,"
"Reshape Reshape_459 1 1 527 534 0 4 4 0 -1 16 1 ,"
"Convolution Conv_460 1 1 506 535 1 96 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_461 1 1 535 536 4 0 2 3 1 ,"
"Reshape Reshape_468 1 1 536 543 0 4 4 0 -1 16 1 ,"
"Concat Concat_469 2 1 534 543 544 1 ,"
